<!DOCTYPE html>
<html>
<head>
    <title>Вредоносные программы</title>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" type="text/css" href="styleTest.css">
</head>
<body>
<header>
    <nav>
        <div class="logo">ANTIVIRUS</div>
        <ul>
            <li><a href="main.php">Главная</a></li>
            <li><a href="test.php">Вредоносные программы</a>
                <ul>
                    <li><a href="#section1">Виды</a></li>
                    <li><a href="#section2">Способы распространения</a></li>
                    <li><a href="#section3">Методы защиты</a></li>
                </ul>
            </li>
            <li><a href="index2.html">Антивирусные программы</a>
                <ul>
                    <li><a href="index2.html">Программы</a></li>
                    <li><a href="index2.html">История появления</a></li>
                    <li><a href="index2.html">Интересные факты</a></li>
                </ul>
            </li>

        </ul>
    </nav>
</header>

<main>
    <div class="background-text">
    <h1>Вредоносные программы</h1>


    <section>
        <h2 id="section1">Виды вредоносных программ</h2>
        <p>Существует множество различных видов вредоносных программ, которые могут нанести вред вашему компьютеру и личной информации. Некоторые из наиболее распространенных видов вредоносных программ включают:</p>
        <ul>
            <li>Вирусы - это программа, которая может копировать себя и распространяться на другие компьютеры через сеть или зараженные носители информации. Вирусы могут удалять, изменять или блокировать файлы на компьютере и наносить другой вред.</li>
            <li>Черви - это программа, которая распространяется через сеть, используя уязвимости компьютеров. Черви могут устанавливать заднюю дверь на компьютерах и использоваться злоумышленниками для удаленного доступа и контроля.</li>
            <li>Троянские кони - это программа, которая скрывается под видом полезной или безвредной программы, но фактически выполняет нежелательные действия на компьютере пользователя. Троянские кони могут воровать личную информацию, устанавливать заднюю дверь на компьютерах и использоваться для удаленного контроля.</li>
            <li>Шпионское ПО - это программа, которая скрытно собирает личную информацию о пользователе и передает ее злоумышленникам. Шпионское ПО может устанавливаться через фишинговые сообщения и ссылки, а также через уязвимости в операционной системе и другом программном обеспечении.</li>
            <li>Рекламное ПО - это программа, которая отображает нежелательную рекламу на компьютере пользователя. Рекламное ПО может устанавливаться вместе с бесплатным программным обеспечением или через фишинговые ссылки и сообщения.</li>
            <li>Руткиты - это программа, которая скрывает свое присутствие на компьютере и позволяет злоумышленникам получить неограниченный доступ к системе. Руткиты могут использоваться для установки задней двери на компьютерах и воровства личной информации.</li>
        </ul>
        <p>Каждый вид вредоносных программ имеет свои особенности и способы распространения.</p>
        <img src="img/img1.bmp" alt="Вирусы" width="700">
    </section>

    <section>
        <h2 id="section2">Способы распространения вредоносных программ</h2>
        <p>Вредоносные программы могут распространяться различными способами:</p>
        <ul>
            <li>По электронной почте</li>
            <li>По сети Интернет</li>
            <li>С помощью зараженных носителей информации</li>
            <li>С помощью социальной инженерии</li>
        </ul>
        <p>Чаще всего вредоносные программы распространяются с помощью социальной инженерии, когда злоумышленники используют манипуляции и обман, чтобы заставить пользователей установить вредоносное ПО.
            <br> Вредоносные веб-сайты могут содержать скрытые скрипты или ссылки, которые автоматически загружают вредоносные программы на компьютер пользователя. Злоумышленники могут также использовать манипуляции с помощью фишинговых сообщений и ссылок, чтобы перенаправить пользователей на вредоносные веб-сайты.
            <br>
            Эксплоиты - это программы, которые используют уязвимости в операционной системе или другом программном обеспечении, чтобы получить несанкционированный доступ к системе. Злоумышленники могут использовать эксплоиты для установки вредоносных программ без ведома пользователя.

        </p>
        <img src="img/img2.jpg" alt="Распространение вредоносных программ" width="700">
    </section>

    <section>
        <h2 id="section3">Методы защиты от вредоносных программ</h2>
        <p>Существует множество методов защиты от вредоносных программ:</p>
        <ul>
            <li>Использование антивирусных программ</li>
            <li>Установка обновлений безопасности</li>
            <li>Осторожность при скачивании и установке программ</li>
            <li>Безопасное поведение в Интернете</li>
        </ul>
        <p>Одним из наиболее эффективных методов защиты от вредоносных программ является использование антивирусного программного обеспечения. Антивирусное программное обеспечение может обнаруживать и блокировать вредоносные программы, прежде чем они успеют нанести вред вашему компьютеру и личной информации. Рекомендуется устанавливать антивирусное программное обеспечение на ваш компьютер и регулярно обновлять его, чтобы быть защищенным от новых угроз.
        <br>
        Регулярное обновление операционной системы и установленного программного обеспечения также может помочь защитить ваш компьютер от вредоносных программ. Обновления часто содержат исправления уязвимостей, которые могут быть использованы злоумышленниками для установки вредоносных программ на компьютере. Рекомендуется включать автоматические обновления, чтобы обеспечить защиту от новых угроз.
        <br>
        Осмотрительность при работе в Интернете может помочь избежать установки вредоносных программ. Не следует открывать подозрительные вложения в электронной почте, не переходить на подозрительные веб-сайты и не скачивать программное обеспечение с ненадежных источников. Также рекомендуется использовать анти-фишинговые и анти-мошеннические функции веб-браузера, чтобы избежать перенаправления на поддельные веб-сайты и защитить вашу личную информацию.
        <br>
        Файрвол - это программа, которая может блокировать нежелательный трафик и предотвращать несанкционированный доступ к вашему компьютеру по сети. Использование файрвола может помочь защитить ваш компьютер от вредоносных программ, которые пытаются получить доступ к вашей системе через Интернет. Рекомендуется включать файрвол в операционной системе и настройте его правильно, чтобы обеспечить эффективную защиту.

        </p>
        <p>Однако ни один метод защиты не может обеспечить 100% защиту от вредоносных программ, поэтому важно быть осторожным и следить за безопасностью своей компьютерной системы.</p>
        <img src="protection.jpg" alt="Методы защиты от вредоносных программ" width="300">
    </section>
    </div>
</main>



</body>
</html>